Tekla Open API Reference for Tekla Structures 2025
TransformationPlane Constructor (CoordinateSystem)
 Creates a new transformation plane defined by the given coordinate system.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public TransformationPlane(
	CoordinateSystem CoordinateSystem
)
Public Sub New (
	CoordinateSystem As CoordinateSystem
)
Parameters
CoordinateSystem
Type: Tekla.Structures.Geometry3d.CoordinateSystem
The coordinate system to be used.
See Also
Reference
TransformationPlane Class
TransformationPlane Overload
Tekla.Structures.Model Namespace